Repository: fanelsi-pets/localvoice
Catalog: LocalVoice/Localizable.xcstrings
Source language: en
Languages: uk

source: Drop audio or video files here
uk: Перетягніть сюди аудіо- чи відеофайли

source: Drop files anywhere to add more
uk: Перетягніть файли в будь-яке місце, щоб додати більше

source: Drop to add files
uk: Відпустіть, щоб додати файли

source: Duration
uk: Тривалість

source: During recording, press Option + 1-9 to switch modes quickly.
uk: Під час запису натисніть Option + 1-9, щоб швидко перемикати режими.

source: e.g. my email, my mail
uk: напр. моя електронна пошта, моя пошта

source: e.g. Acme, LocalVoice
uk: напр. Acme, LocalVoice

source: e.g. support@trylocalvoice.com
uk: напр. support@trylocalvoice.com

source: Each trigger word can only belong to one mode
uk: Кожне тригерне ​​слово може належати лише одному режиму

source: Each website can only belong to one mode
uk: Кожен веб-сайт може належати лише одному режиму

source: Edit
uk: Редагувати

source: Edit Custom Enhancement Model
uk: Редагувати спеціальну модель покращення

source: Edit Custom Transcription Model
uk: Редагувати спеціальну модель транскрипції

source: Edit mode
uk: Режим редагування

source: Edit Model
uk: Редагувати модель

source: Edit prompt
uk: Редагувати підказку

source: Edit replacement
uk: Редагувати заміну

source: Edit the apps and websites in this group.
uk: Редагувати програми та веб-сайти в цій групі.

source: Edit trigger group
uk: Редагувати групу тригерів

source: Edit Word Replacement
uk: Редагувати заміну слів

source: Email
uk: Електронна пошта

source: Email Support
uk: Підтримка електронною поштою

source: Emoji already exists.
uk: Emoji вже існує.

source: Emoji cannot be empty.
uk: Emoji не може бути пустим.

source: Enable Accessibility Access
uk: Увімкнути доступ до спеціальних можливостей

source: Enabled
uk: Увімкнено

source: Endpoint must use HTTPS (plain HTTP is allowed only for localhost)
uk: Кінцева точка має використовувати HTTPS (звичайний HTTP дозволений лише для локального хосту)

source: Endpoint not found (HTTP 404) — check the API endpoint URL
uk: Кінцева точка не знайдена (HTTP 404) — перевірте URL-адресу кінцевої точки API

source: English
uk: Англійська

source: English-only Parakeet model with native realtime transcription support
uk: Лише англійська модель Parakeet із вбудованою підтримкою транскрипції в реальному часі

source: Enhance
uk: Поліпшення

source: Enhanced
uk: Покращений

source: Enhancement
uk: Покращення

source: Enhancement failed: %@
uk: Помилка покращення: %@

source: Enhancement Model
uk: Модель покращення

source: Enhancement Models
uk: Моделі покращення

source: Enhancement modes and AI actions will stay off. You can always set it up later in the app.
uk: Режими вдосконалення та дії ШІ залишаться вимкненими. Ви завжди можете налаштувати це пізніше в додатку.

source: Enhancement request timed out. Check your connection or increase the timeout duration.
uk: Час очікування запиту на покращення минув. Перевірте підключення або збільште час очікування.

source: Enhancement Settings
uk: Налаштування покращення

source: Enhancement Time
uk: Час покращення

source: Enhancing
uk: Підвищення

source: Enhancing recording
uk: Поліпшення запису

source: Enhancing...
uk: Підвищення...

source: Enhancing…
uk: Підвищення…

source: Enter word or phrase to replace (use commas for multiple)
uk: Введіть слово або фразу для заміни (використовуйте коми для кількох)

source: Enter your
uk: Введіть свій

source: Enter your %@ API key
uk: Введіть свій ключ API %@

source: Environment variables available: LOCALVOICE_SYSTEM_PROMPT, LOCALVOICE_USER_PROMPT, LOCALVOICE_FULL_PROMPT. LocalVoice also writes LOCALVOICE_FULL_PROMPT to stdin for every command.
uk: Доступні змінні середовища: LOCALVOICE_SYSTEM_PROMPT, LOCALVOICE_USER_PROMPT, LOCALVOICE_FULL_PROMPT. LocalVoice також записує LOCALVOICE_FULL_PROMPT у стандартний вхід для кожної команди.

source: Error
uk: Помилка

source: Error importing settings: %@. The file might be corrupted or not in the correct format.
uk: Помилка імпортування налаштувань: %@. Файл може бути пошкоджений або мати неправильний формат.

source: Est. duration
uk: Приблизно тривалість

source: Est. tokens
uk: Приблизно жетони

source: Examples
uk: Приклади

source: Experience LocalVoice
uk: Спробуйте LocalVoice

source: Experimental
uk: Експериментальний

source: Export
uk: Експорт

source: Export all settings, or choose specific categories when importing a backup.
uk: Експортуйте всі налаштування або виберіть окремі категорії під час імпорту резервної копії.

source: Export Canceled
uk: Експорт скасовано

source: Export Error
uk: Помилка експорту

source: Export Failed
uk: Помилка експорту

source: Export LocalVoice Settings
uk: Експорт налаштувань LocalVoice

source: Export Logs
uk: Експорт журналів

source: Export Settings
uk: Налаштування експорту

source: Export Successful
uk: Експорт успішно

source: Fail immediately
uk: Відразу потерпіть невдачу

source: Failed to add '%@': %@
uk: Не вдалося додати "%@": %@

source: Failed to add replacement: %@
uk: Не вдалося додати заміну: %@

source: Failed to convert audio chunk for streaming
uk: Не вдалося перетворити аудіофрагмент для потокового передавання

source: Failed to convert the audio format
uk: Не вдалося конвертувати аудіоформат

source: Failed to copy audio file
uk: Не вдалося скопіювати аудіофайл

source: Failed to copy transcription
uk: Не вдалося скопіювати транскрипцію

source: Failed to create audio file: %lld
uk: Не вдалося створити аудіофайл: %lld

source: Failed to create AudioUnit: %lld
uk: Не вдалося створити AudioUnit: %lld

source: Failed to create custom sounds directory
uk: Не вдалося створити власний каталог звуків

source: Failed to disable output: %lld
uk: Не вдалося вимкнути вихід: %lld

source: Failed to enable input: %lld
uk: Не вдалося ввімкнути введення: %lld

source: Failed to encode the request body.
uk: Не вдалося закодувати тіло запиту.

source: Failed to execute Local CLI command: %@
uk: Не вдалося виконати команду локального CLI: %@

source: Failed to export the processed audio
uk: Не вдалося експортувати оброблене аудіо

source: Failed to extract audio samples
uk: Не вдалося отримати зразки аудіо

source: Failed to get device format: %lld
uk: Не вдалося отримати формат пристрою: %lld

source: Failed to import model: %@
uk: Не вдалося імпортувати модель: %@

source: Failed to initialize AudioUnit: %lld
uk: Не вдалося ініціалізувати AudioUnit: %lld

source: Failed to load the transcription model.
uk: Не вдалося завантажити модель транскрипції.

source: Failed to remove replacement: %@
uk: Не вдалося видалити заміну: %@

source: Failed to remove word: %@
uk: Не вдалося видалити слово: %@

source: Failed to save API key securely
uk: Не вдалося безпечно зберегти ключ API

source: Failed to save changes: %@
uk: Не вдалося зберегти зміни: %@

source: Failed to save custom enhancement model
uk: Не вдалося зберегти спеціальну модель покращення

source: Failed to save imported %@: %@
uk: Не вдалося зберегти імпортований %@: %@

source: Failed to set audio format: %lld
uk: Не вдалося встановити аудіоформат: %lld

source: Failed to set file format: %lld
uk: Не вдалося встановити формат файлу: %lld

source: Failed to set input callback: %lld
uk: Не вдалося встановити зворотний виклик введення: %lld

source: Failed to set input device: %lld
uk: Не вдалося встановити пристрій введення: %lld

source: Failed to start AudioUnit: %lld
uk: Не вдалося запустити AudioUnit: %lld

source: Failed to transcribe the audio.
uk: Не вдалося транскрибувати аудіо.

source: Failed to unzip the downloaded Core ML model.
uk: Не вдалося розпакувати завантажену модель Core ML.

source: Fast multilingual transcription that runs locally on Mac.
uk: Швидка багатомовна транскрипція, яка працює локально на Mac.

source: Fast transcription with no AI enhancement.
uk: Швидка транскрипція без покращення AI.

source: Filler word
uk: Слово-наповнювач

source: Finalizing models...
uk: Доопрацювання моделей...

source: Find the best transcription setup
uk: Знайдіть найкраще налаштування транскрипції

source: Finish Onboarding
uk: Завершити адаптацію

source: Finishing…
uk: Завершення…

source: Free updates
uk: Безкоштовні оновлення

source: Gemini API Key
uk: Ключ Gemini API

source: General
uk: Загальні

source: General Settings
uk: Загальні налаштування

source: Get %@ API Key
uk: Отримайте ключ API %@

source: Get API key
uk: Отримати API-ключ

source: Get API Key
uk: Отримайте ключ API

source: Good afternoon
uk: доброго дня

source: Good evening
uk: добрий вечір

source: Good morning
uk: доброго ранку

source: Google's current stable, low-latency multimodal model
uk: Поточна стабільна мультимодальна модель Google із низькою затримкою

source: Google's smallest stable and most cost-efficient multimodal model
uk: Найменша стабільна та найрентабельніша мультимодальна модель Google

source: Granted
uk: Дозволено

source: HAL Output AudioUnit not found
uk: Вихідний аудіоблок HAL не знайдено

source: Have feedback, a bug report, or something that feels off? Send a note with system information by email, or join Discord for community discussion. Every report helps make LocalVoice more reliable and easier to use.
uk: Маєте відгук, звіт про помилку чи щось неприємне? Надішліть замітку з інформацією про систему електронною поштою або приєднайтеся до Discord для обговорення спільноти. Кожен звіт допомагає зробити LocalVoice надійнішим і простішим у використанні.

source: Hi
uk: привіт

source: Hide Dock Icon
uk: Приховати значок док-станції

source: Higher-accuracy OpenAI transcription at a higher API cost
uk: Вища точність транскрипції OpenAI за вищої вартості API

source: Higher-quality Gemini transcription with a higher API cost
uk: Вища якість транскрипції Gemini з вищою ціною API

source: History
uk: Історія

source: History settings
uk: Налаштування історії

source: History Settings
uk: Налаштування історії

source: Homer's Iliad
uk: Іліада Гомера

source: Homer's Iliad and Odyssey
uk: Іліада та Одіссея Гомера

source: Homer's Odyssey
uk: Одіссея Гомера

source: Hourly dictation activity
uk: Діяльність погодинного диктанту

source: hours
uk: години

source: How to create and copy the API key
uk: Як створити та скопіювати ключ API

source: How to use Word Replacements
uk: Як використовувати заміни слів

source: Hybrid
uk: Гібрид

source: Immediately
uk: Негайно

source: Import
uk: Імпорт

source: Import Canceled
uk: Імпорт скасовано

source: Import Error
uk: Помилка імпорту

source: Import Local Model…
uk: Імпортувати локальну модель…

source: Import LocalVoice Settings
uk: Імпорт налаштувань LocalVoice

source: Import Settings
uk: Налаштування імпорту

source: Import Successful
uk: Імпорт успішний

source: IMPORTANT: If you were using AI enhancement features, please make sure to reconfigure your API keys in the AI Models section.
uk: ВАЖЛИВО: якщо ви використовували функції вдосконалення штучного інтелекту, переконайтеся, що ви повторно налаштували свої ключі API в розділі моделей штучного інтелекту.

source: Imported
uk: Імпортні

source: Imported %@
uk: Імпортовано %@

source: Imported local model
uk: Імпортна місцева модель

source: Improving the text…
uk: Покращую текст…

source: Individual categories
uk: Індивідуальні категорії

source: Info
uk: Інформація

source: Instructions
uk: Інструкції

source: Interface
uk: Інтерфейс

source: Invalid API key
uk: Недійсний ключ API

source: Invalid Audio File
uk: Недійсний аудіофайл

source: Invalid audio file format
uk: Недійсний формат аудіофайлу

source: Invalid emoji.
uk: Недійсний емодзі.

source: Invalid model type provided for Native Apple transcription.
uk: Для рідної транскрипції Apple надано недійсний тип моделі.

source: Invalid Ollama server URL
uk: Недійсна URL-адреса сервера Ollama

source: Invalid response from AI provider.
uk: Недійсна відповідь від постачальника AI.

source: Invalid response from Ollama server
uk: Недійсна відповідь від сервера Ollama

source: It is recommended that you complete the onboarding.
uk: Рекомендується завершити адаптацію.

source: It is recommended to restart LocalVoice for all changes to take full effect.
uk: Рекомендується перезапустити LocalVoice, щоб усі зміни набули чинності.

source: Join Discord
uk: Приєднуйтесь до Discord

source: Keep Audio For
uk: Зберегти аудіо для

source: Keep Clipboard Content
uk: Зберігати вміст буфера обміну

source: Keep Transcriptions
uk: Зберігати транскрипції

source: Key verified
uk: Ключ перевірено

source: Keyboard Shortcut
uk: Комбінація клавіш

source: Language
uk: Мова

source: Language: %@
uk: Мова: %@

source: Language: Autodetected
uk: Мова: визначається автоматично

source: Language: English
uk: Мова: англійська

source: Language: English (only)
uk: Мова: англійська (лише)

source: Large model v2, slower than Medium but more accurate
uk: Велика модель v2, повільніша за середню, але точніша

source: Large model v3 Turbo, faster than v3 with similar accuracy
uk: Велика модель v3 Turbo, швидша за v3 з аналогічною точністю

source: Large model v3, very slow but most accurate
uk: Велика модель v3, дуже повільна, але максимально точна

source: Last 7 Days
uk: Останні 7 днів

source: Last 30 Days
uk: Останні 30 днів

source: Last transcription copied
uk: Останню транскрипцію скопійовано

source: Latest fixes and releases
uk: Останні виправлення та випуски

source: Launch at Login
uk: Запускати після входу

source: Learn more
uk: Дізнайтесь більше

source: Lifetime access
uk: Довічний доступ

source: Lifetime access.
uk: Довічний доступ.

source: Light
uk: світло

source: Listening…
uk: Слухаю…

source: Listing files from repository...
uk: Перелік файлів зі сховища...

source: Live Text Display
uk: Відображення живого тексту

source: Load a template or enter a command to enable Local CLI enhancement.
uk: Завантажте шаблон або введіть команду, щоб увімкнути покращення локального CLI.

source: Load More
uk: Завантажити більше

source: Load Template
uk: Завантажити шаблон

source: Loading
uk: Завантаження

source: Loading apps
uk: Завантаження програм

source: Loading model...
uk: Завантаження моделі...

source: Loading...
uk: Завантаження...

source: Local
uk: Локально

source: Local mode keeps everything on this Mac.
uk: У локальному режимі все залишається на цьому Mac.

source: Fully local on this Mac
uk: Повністю локально на цьому Mac

source: Local & CLI Providers
uk: Місцеві постачальники та постачальники CLI

source: Local CLI
uk: Локальний CLI

source: Local CLI command failed with exit code %lld: %@
uk: Помилка локальної команди CLI з кодом виходу %lld: %@

source: Local CLI command failed with exit code %lld.
uk: Помилка локальної команди CLI з кодом виходу %lld.

source: Local CLI command is not configured. Load a template or enter a command first.
uk: Команда локального CLI не налаштована. Спочатку завантажте шаблон або введіть команду.

source: Local CLI command returned empty output.
uk: Команда локального CLI повернула порожній результат.

source: Local CLI command timed out after %lld seconds.
uk: Команда локального CLI минув через %lld секунд.

source: Local CLI command was not found. Use an absolute path or fix your shell PATH. Details: %@
uk: Локальну команду CLI не знайдено. Використовуйте абсолютний шлях або виправте свою оболонку PATH. Деталі: %@

source: Local Models
uk: Локальні моделі

source: Local models don't work reliably on Intel Macs
uk: Локальні моделі не працюють надійно на комп’ютерах Intel Mac

source: Local server
uk: Локальний сервер

source: Local Storage
uk: Локальна пам'ять

source: Local transcription stays on this Mac. Cloud transcription is used only when you explicitly choose Gemini or OpenAI in settings.
uk: Локальна транскрипція залишається на цьому Mac. Хмарна транскрипція використовується лише тоді, коли ви явно обираєте Gemini або OpenAI у налаштуваннях.

source: Local Voice
uk: Місцевий голос

source: Local Voice is always local
uk: Місцевий голос завжди місцевий

source: Local Voice is fully offline. No data can leave your device.
uk: Local Voice повністю офлайн. Дані не можуть залишити ваш пристрій.

source: Local Voice is getting ready.
uk: Local Voice готується до запису.

source: Local Voice is open source and cannot make network connections. Audio, transcripts, and settings remain on this Mac.
uk: Local Voice є відкритим вихідним кодом і не може підключатися до мережі. Аудіо, стенограми та налаштування залишаються на цьому Mac.

source: Local Voice is processing
uk: Local Voice обробляється

source: Local Voice is recording
uk: Local Voice записує

source: Local Voice never downloads models. After setup, open AI Models and import a compatible Whisper model from this Mac.
uk: Local Voice ніколи не завантажує моделі. Після налаштування відкрийте AI Models та імпортуйте сумісну модель Whisper із цього Mac.

source: LocalVoice app is not available
uk: Програма LocalVoice недоступна

source: LocalVoice automatically understands what you are working with and selects your preferred setup. You can always configure this by editing or creating new modes.
uk: LocalVoice автоматично розуміє, з чим ви працюєте, і вибирає бажані налаштування. Ви завжди можете налаштувати це шляхом редагування або створення нових режимів.

source: LocalVoice can select the right mode from the app you are using and the rules you configure.
uk: LocalVoice може вибрати правильний режим із програми, яку ви використовуєте, і правил, які ви налаштовуєте.

source: LocalVoice couldn't access its storage location. Your transcriptions will not be saved between sessions.
uk: LocalVoice не може отримати доступ до місця зберігання. Ваші транскрипції не зберігатимуться між сеансами.

source: LocalVoice is Context-Aware
uk: LocalVoice є контекстно-залежним

source: LocalVoice is context-aware.
uk: LocalVoice є контекстно-залежним.

source: LocalVoice is Open Source
uk: LocalVoice є відкритим кодом

source: LocalVoice Modes
uk: Режими LocalVoice

source: LocalVoice modes include Dictation, Enhance, Email, Assistant, Rewrite, Ask, Summarize, and Translate.
uk: Режими LocalVoice включають Диктування, Покращення, Електронна пошта, Помічник, Перезапис, Запитання, Резюме та Переклад.

source: LocalVoice progress
uk: Прогрес LocalVoice

source: LocalVoice recorder dismissed
uk: Диктофон LocalVoice вимкнено

source: LocalVoice recorder toggled
uk: Рекордер LocalVoice увімкнено

source: LocalVoice recording service is not available
uk: Служба запису LocalVoice недоступна

source: LocalVoice temporarily uses the clipboard to paste transcription. When enabled, it restores your previous clipboard content after the selected delay. When disabled, the pasted transcription stays on your clipboard.
uk: LocalVoice тимчасово використовує буфер обміну, щоб вставити транскрипцію. Якщо ввімкнено, він відновлює попередній вміст буфера обміну після вибраної затримки. Якщо вимкнено, вставлена ​​транскрипція залишається в буфері обміну.

source: LocalVoice uses Accessibility to type transcriptions directly into any app.
uk: LocalVoice використовує доступність, щоб вводити транскрипції безпосередньо в будь-яку програму.

source: LocalVoice uses LLMs to enhance transcripts and perform AI actions. Set up an API key before continuing.
uk: LocalVoice використовує LLM для покращення стенограм і виконання дій ШІ. Перш ніж продовжити, налаштуйте ключ API.

source: LocalVoice uses your microphone to capture your voice.
uk: LocalVoice використовує ваш мікрофон, щоб перехопити ваш голос.

source: Locked
uk: Заблоковано

source: Lost Key?
uk: Загубили ключ?

source: Lowercase and Paste
uk: Нижній регістр і Вставити

source: Manage custom enhancement models in the Custom tab.
uk: Керуйте спеціальними моделями вдосконалення на вкладці «Спеціальні».

source: Manage Models
uk: Керування моделями

source: Manage Modes
uk: Керування режимами

source: Microphone
uk: Мікрофон

source: Microphone Mode
uk: Режим мікрофона

source: Middle-Click Recording
uk: Запис середнього клацання

source: Mini
uk: Міні

source: Minimum words
uk: Мінімум слів

source: Mode
uk: Режим

source: Mode name
uk: Назва режиму

source: Mode name cannot be empty.
uk: Назва режиму не може бути пустою.

source: Mode shortcuts
uk: Ярлики режимів

source: Mode:
uk: режим:

source: Mode: %@
uk: Режим: %@

source: model
uk: модель

source: Model
uk: Модель

source: Model Catalog
uk: Каталог моделей

source: Model imported from this Mac
uk: Модель імпортовано з цього Mac

source: Model Name
uk: Назва моделі

source: Model name cannot be empty
uk: Назва моделі не може бути пустою

source: Model Settings
uk: Параметри моделі

source: Model: %@
uk: Модель: %@

source: models
uk: моделі

source: models available
uk: доступні моделі

source: Modes
uk: Режими

source: Modes help you set up LocalVoice for different writing tasks, workflows, and scenarios.
uk: Режими допомагають налаштувати LocalVoice для різних письмових завдань, робочих процесів і сценаріїв.

source: Modes Settings
uk: Налаштування режимів

source: Monthly Productivity
uk: Щомісячна продуктивність

source: More accurate English-only Whisper model; downloaded on demand
uk: Точніша модель Whisper лише англійською мовою; завантажується на вимогу

source: More accurate multilingual Whisper model; downloaded on demand
uk: Більш точна багатомовна модель Whisper; завантажується на вимогу

source: More enhancement models available
uk: Доступно більше моделей покращення

source: More transcription models available
uk: Доступно більше моделей транскрипції

source: Move down
uk: Рухатися вниз

source: Move up
uk: Рухатися вгору

source: ms
uk: РС

source: Multilingual
uk: Багатомовний

source: Multilingual Model
uk: Багатомовна модель

source: Mute Audio While Recording
uk: Вимкнення звуку під час запису

source: My Custom Model
uk: Моя індивідуальна модель

source: My Enhancement Model
uk: Моя модель покращення

source: my website link
uk: посилання на мій сайт

source: Name cannot be empty
uk: Назва не може бути пустою

source: Native Apple
uk: Рідне яблуко

source: Needs access
uk: Потрібен доступ

source: Network connection failed. Check your internet.
uk: Помилка підключення до мережі. Перевірте свій Інтернет.

source: No AI Model Selected
uk: Модель AI не вибрано

source: No Apps
uk: Немає додатків

source: No apps found
uk: Програм не знайдено

source: No audio duration
uk: Без тривалості аудіо

source: No audio files found older than %lld days.
uk: Не знайдено аудіофайлів старше %lld днів.

source: No automatic triggers
uk: Немає автоматичних тригерів

source: No Custom Enhancement Models
uk: Немає спеціальних моделей покращення

source: No Custom Transcription Models
uk: Немає спеціальних моделей транскрипції

source: No devices available
uk: Немає доступних пристроїв

source: No dictated words in this period yet
uk: Надиктованих слів у цей період ще немає

source: No enhancement models
uk: Немає моделей покращення

source: No enhancement timings
uk: Немає таймінгу покращення

source: No error message
uk: Немає повідомлення про помилку

source: No hourly pattern yet.
uk: Ще немає погодинної схеми.

source: No matching apps
uk: Немає відповідних програм

source: No Metadata
uk: Без метаданих

source: No microphones found
uk: Мікрофони не знайдено

source: No mode selected
uk: Режим не вибрано

source: No model configured
uk: Модель не налаштована

source: No model performance
uk: Немає продуктивності моделі

source: No model performance for this period
uk: Немає продуктивності моделі за цей період

source: No model performance in selection
uk: У виборі немає продуктивності моделі

source: No model selected
uk: Модель не вибрано

source: No model usage
uk: Модель не використовується

source: No model usage for this period
uk: За цей період модель не використовувалася

source: No models
uk: Немає моделей

source: No models available
uk: Немає доступних моделей

source: No models listed.
uk: Немає моделей у списку.
